cosc561/copt/writeup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-05 Fri 19:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>=copt= Writeup</title>
<meta name="author" content="Jackson Mowry" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title"><code>copt</code> Writeup</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org57d9080">1. Optimization Details</a>
<ul>
<li><a href="#orgb5e9dea">1.1. Matrix Initialization</a>
<ul>
<li><a href="#org2e2cf93">1.1.1. Challenges</a></li>
</ul>
</li>
<li><a href="#orgec695a5">1.2. Array Initialization</a>
<ul>
<li><a href="#orgc9a1557">1.2.1. Challenges</a></li>
</ul>
</li>
<li><a href="#orgeb33fa5">1.3. Factorial</a>
<ul>
<li><a href="#org5ee90e2">1.3.1. Challenges</a></li>
</ul>
</li>
<li><a href="#orgc9d7ed5">1.4. Matrix Multiplication</a>
<ul>
<li><a href="#org73f84e0">1.4.1. Challenges</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6e4ae17">2. Comparison of Results</a>
<ul>
<li><a href="#org31cdb44">2.1. <code>-O0</code></a>
<ul>
<li><a href="#org9bf20fb">2.1.1. <code>copt_O0</code></a></li>
<li><a href="#org5044f93">2.1.2. <code>copt_O0_ref</code></a></li>
</ul>
</li>
<li><a href="#orga69d868">2.2. <code>-O3</code></a>
<ul>
<li><a href="#orgfbc6862">2.2.1. <code>copt_O3</code></a></li>
<li><a href="#orgf9de206">2.2.2. <code>copt_O3_ref</code></a></li>
</ul>
</li>
<li><a href="#org02ccd8b">2.3. What Optimizations are Effective and Where?</a></li>
<li><a href="#org942759a">2.4. Why Does <code>-O3</code> Hurt Some Optimizations?</a></li>
<li><a href="#orgb6d9826">2.5. What Optimizations Are Unaffected or Benefited by <code>-O3</code>?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org57d9080" class="outline-2">
<h2 id="org57d9080"><span class="section-number-2">1.</span> Optimization Details</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb5e9dea" class="outline-3">
<h3 id="orgb5e9dea"><span class="section-number-3">1.1.</span> Matrix Initialization</h3>
<div class="outline-text-3" id="text-1-1">
<p>
For the matrix initialization subroutine I found that eliminating function calls to helper functions (i.e. <code>check</code> and <code>set</code>) provided a significant speed up.<br />
</p>

<p>
Originally my plan was to use the <code>register</code> keyword for all local variables. Utilizing <code>register</code> tells the compiler to store our values directly in registers, avoiding writing them to memory when possible. When using <code>-O0</code> we&rsquo;re inhibiting the compiler from applying these register optimizations automatically, therefore adding it explicitly enables the compiler to generate more efficient assembly.<br />
</p>

<p>
Additionally, I found a small speed up from computing the index of the matrix row and final column before access each matrix, which avoids duplicate computation of the final index. Without this &ldquo;memoization&rdquo; the compiler generates duplicate instructions when generating the address for <code>mat1</code> and <code>mat2</code>.<br />
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #c678dd;">.L4</span>:
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">mat1
</span>        <span style="color: #51afef;">mov</span>     eax, ebx                <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Duplicate 1
</span>        <span style="color: #51afef;">imul</span>    eax, r12d               <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Duplicate 2
</span>        <span style="color: #51afef;">add</span>     eax, r13d               <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Duplicate 3
</span>        <span style="color: #51afef;">cdqe</span>                            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Duplicate 4
</span>        <span style="color: #51afef;">sal</span>     rax, 2                  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Duplicate 5
</span>        <span style="color: #51afef;">add</span>     rax, r14               
        <span style="color: #51afef;">mov</span>     DWORD PTR [rax], ebx
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">mat 2
</span>        <span style="color: #51afef;">mov</span>     eax, ebx                <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Duplicate 1
</span>        <span style="color: #51afef;">imul</span>    eax, r12d               <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Duplicate 2
</span>        <span style="color: #51afef;">add</span>     eax, r13d               <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Duplicate 3
</span>        <span style="color: #51afef;">cdqe</span>                            <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Duplicate 4
</span>        <span style="color: #51afef;">sal</span>     rax, 2                  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Duplicate 5
</span>        <span style="color: #51afef;">lea</span>     rdx, [r15+rax]
        <span style="color: #51afef;">lea</span>     eax, [rbx+1]
        <span style="color: #51afef;">mov</span>     DWORD PTR [rdx], eax
</pre>
</div>

<p>
With &ldquo;memoization&rdquo; we get the following assembly.<br />
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #c678dd;">.L4</span>:
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Memoized index computation
</span>        <span style="color: #51afef;">mov</span>     eax, edi
        <span style="color: #51afef;">lea</span>     r14d, [rax+r13]
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">mat1
</span>        <span style="color: #51afef;">movsx</span>   rax, r14d               <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Duplicate 1
</span>        <span style="color: #51afef;">sal</span>     rax, 2                  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Duplicate 2
</span>        <span style="color: #51afef;">add</span>     rax, r15
        <span style="color: #51afef;">mov</span>     DWORD PTR [rax], ebx
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">mat2
</span>        <span style="color: #51afef;">movsx</span>   rax, r14d               <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Duplicate 1
</span>        <span style="color: #51afef;">sal</span>     rax, 2                  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Duplicate 2
</span>        <span style="color: #51afef;">mov</span>     rcx, rsi
        <span style="color: #51afef;">lea</span>     rdx, [rcx+rax]
        <span style="color: #51afef;">lea</span>     eax, [rbx+1]
        <span style="color: #51afef;">mov</span>     DWORD PTR [rdx], eax
</pre>
</div>

<p>
However, once I began looking at the assembly I realized this was still doing some duplicate work. I then decided to try and utilize <code>memset</code> to solve the problem, though eventually switched to <code>wmemset</code> as will be discussed in the following section. This provided a speed improvement from around 7.9x over the unoptimized implementation, to 10.9x the unoptimized subroutine.<br />
</p>
</div>
<div id="outline-container-org2e2cf93" class="outline-4">
<h4 id="org2e2cf93"><span class="section-number-4">1.1.1.</span> Challenges</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<code>memset</code> only works on bytes, therefore <code>wmemset</code> has to be used to work with 4 bytes at once. This is a hacky and non-portable solution, as <code>wchar_t</code> is 4 bytes on Linux/Mac, and only 2 bytes on Windoze.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-orgec695a5" class="outline-3">
<h3 id="orgec695a5"><span class="section-number-3">1.2.</span> Array Initialization</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Array initialization is a typical serial loop with no dependencies across iterations, therefore the most straightforward optimization is to unroll the loop to take advantage of the ILP available within our processor. I decided to unroll the loop 16 times, though didn&rsquo;t test values smaller or larger than 16. In addition to loop unrolling I am also prefetching 64 bytes ahead of where we&rsquo;re working at the top of each loop, allowing the cache to hopefully be filled by the time we move to the next row.<br />
</p>

<p>
In additional to the above major optimizations I replaced all constants and math operations with efficient left shifts, something the compiler would do for us if optimizations were enabled.<br />
</p>
</div>
<div id="outline-container-orgc9a1557" class="outline-4">
<h4 id="orgc9a1557"><span class="section-number-4">1.2.1.</span> Challenges</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Because the loop is manually unrolled we need to ensure and input lengths that are not a multiple of 16 are handled correctly. This is often referred to as the &ldquo;strip-mining&rdquo; technique, with one main loop performing the unrolled body, and a second smaller loop handling the remainder in a scalar manner.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-orgeb33fa5" class="outline-3">
<h3 id="orgeb33fa5"><span class="section-number-3">1.3.</span> Factorial</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Factorial is once again a serial loop (after rewriting the recursive call into a loop), through this time we have a carry-over dependency, meaning loop unrolling would still create a serial chain. However, I was able to achieve a significant speed improvement just by using the register keyword on all local variables. This allows for the branch comparison and accumulator multiplication to avoid writing/reading to/from memory. Again I prefetch the result memory address before the loop begins to ensure it is resident in cache.<br />
</p>
</div>
<div id="outline-container-org5ee90e2" class="outline-4">
<h4 id="org5ee90e2"><span class="section-number-4">1.3.1.</span> Challenges</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
There were no real challenged for this implementation, through I avoided loop unrolling which could have added additional complexity.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-orgc9d7ed5" class="outline-3">
<h3 id="orgc9d7ed5"><span class="section-number-3">1.4.</span> Matrix Multiplication</h3>
<div class="outline-text-3" id="text-1-4">
<p>
I applied the same rough set of optimizations to matrix multiplication, namely the <code>register</code> keyword, and memoizing matrix index computations. These two optimizations alone were enough to grant a sizeable speed up.<br />
</p>
</div>
<div id="outline-container-org73f84e0" class="outline-4">
<h4 id="org73f84e0"><span class="section-number-4">1.4.1.</span> Challenges</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
No challenges for optimizing matrix multiplication.<br />
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org6e4ae17" class="outline-2">
<h2 id="org6e4ae17"><span class="section-number-2">2.</span> Comparison of Results</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org31cdb44" class="outline-3">
<h3 id="org31cdb44"><span class="section-number-3">2.1.</span> <code>-O0</code></h3>
<div class="outline-text-3" id="text-2-1">
<p>
When compiling with <code>-O0</code> my programs beat the reference executable on all 4 benchmarks. The largest delta is for matrix initialization with the reference benchmark showing a 2.65x speedup and my optimizations yielding a 10x speedup. Our closest delta is in the matrix multiplication, 1.54x for the reference, and 2.0x for mine. This makes sense as I performed minimal optimizations for matrix multiplication to keep the code as readable and simple as possible.<br />
</p>
</div>
<div id="outline-container-org9bf20fb" class="outline-4">
<h4 id="org9bf20fb"><span class="section-number-4">2.1.1.</span> <code>copt_O0</code></h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-shell">jmowry4:hydra4 ~/copt&gt; bash test.sh copt_O0                                                                                            &lt;-  5:49PM
Running MATRIX_INIT with n = 3000 loop = 200

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):       16200.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):          1617.0
SPEEDUP:                  10.0

Running ARRAY_INIT with n = 300000 loop = 20000

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):       20866.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):          4100.0
SPEEDUP:                   5.1

Running FACTORIAL with n = 20 loop = 200000000

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):       23083.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):          3317.0
SPEEDUP:                   7.0

Running MATRIX_MULTIPLY with n = 1600 loop = 1

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):       33084.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):         16800.0
SPEEDUP:                   2.0
</pre>
</div>
</div>
</div>
<div id="outline-container-org5044f93" class="outline-4">
<h4 id="org5044f93"><span class="section-number-4">2.1.2.</span> <code>copt_O0_ref</code></h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-shell">jmowry4:hydra4 ~/copt&gt; bash test.sh copt_O0_ref                                                                                        &lt;-  5:50PM
Running MATRIX_INIT with n = 3000 loop = 200

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):       16216.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):          6117.0
SPEEDUP:                  2.65

Running ARRAY_INIT with n = 300000 loop = 20000

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):       20966.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):          6200.0
SPEEDUP:                  3.38

Running FACTORIAL with n = 20 loop = 200000000

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):       23533.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):         10083.0
SPEEDUP:                  2.33

Running MATRIX_MULTIPLY with n = 1600 loop = 1

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):       32967.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):         21384.0
SPEEDUP:                  1.54
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga69d868" class="outline-3">
<h3 id="orga69d868"><span class="section-number-3">2.2.</span> <code>-O3</code></h3>
<div class="outline-text-3" id="text-2-2">
<p>
As I expected, turning optimizations up to <code>-O3</code> negates many of the performance benefits from my optimized solution. This is because my optimizations have likely made the compilers job harder, as it can no longer work with straight forward, easy to analyze loops.<br />
</p>

<p>
It appears that the reference solution observes some of the same pitfalls as my optimizations, only deviating on array initialization and matrix multiplication. My array initialization code manually unrolled a loop 16 times, which likely hindered the compilers ability to optimize this section of code. My matrix multiplication code did not use common optimizations like swapping loop order, or chunking, thereby making little to no different in the generated assembly when optimizations were enabled.<br />
</p>
</div>
<div id="outline-container-orgfbc6862" class="outline-4">
<h4 id="orgfbc6862"><span class="section-number-4">2.2.1.</span> <code>copt_O3</code></h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-shell">jmowry4:hydra4 ~/copt&gt; bash test.sh copt_O3                                                                                                                                                                                                                                            &lt;-  5:52PM
Running MATRIX_INIT with n = 3000 loop = 200

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):        1533.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):          1516.0
SPEEDUP:                   1.0

Running ARRAY_INIT with n = 300000 loop = 20000

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):         933.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):          3983.0
SPEEDUP:                   0.2

Running FACTORIAL with n = 20 loop = 200000000

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):        2050.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):          2016.0
SPEEDUP:                   1.0

Running MATRIX_MULTIPLY with n = 1600 loop = 1

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):        7150.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):          7150.0
SPEEDUP:                   1.0
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf9de206" class="outline-4">
<h4 id="orgf9de206"><span class="section-number-4">2.2.2.</span> <code>copt_O3_ref</code></h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-shell">jmowry4:hydra4 ~/copt&gt; bash test.sh copt_O3_ref                                                                                                                                                                                                                                        &lt;-  5:53PM
Running MATRIX_INIT with n = 3000 loop = 200

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):        1550.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):          1517.0
SPEEDUP:                  1.02

Running ARRAY_INIT with n = 300000 loop = 20000

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):         933.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):          1700.0
SPEEDUP:                  0.55

Running FACTORIAL with n = 20 loop = 200000000

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):        1966.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):          1917.0
SPEEDUP:                  1.03

Running MATRIX_MULTIPLY with n = 1600 loop = 1

<span style="color: #c678dd;">UNOPTIMIZED</span>(ms):        7216.0
<span style="color: #c678dd;">OPTIMIZED</span>(ms):          1617.0
SPEEDUP:                  4.46
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org02ccd8b" class="outline-3">
<h3 id="org02ccd8b"><span class="section-number-3">2.3.</span> What Optimizations are Effective and Where?</h3>
</div>
<div id="outline-container-org942759a" class="outline-3">
<h3 id="org942759a"><span class="section-number-3">2.4.</span> Why Does <code>-O3</code> Hurt Some Optimizations?</h3>
</div>
<div id="outline-container-orgb6d9826" class="outline-3">
<h3 id="orgb6d9826"><span class="section-number-3">2.5.</span> What Optimizations Are Unaffected or Benefited by <code>-O3</code>?</h3>
<div class="outline-text-3" id="text-2-5">
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Fri Dec  5 18:07:21 2025</p>
<p class="author">Author: Jackson Mowry</p>
<p class="date">Created: 2025-12-05 Fri 19:21</p>
</div>
</body>
</html>
